In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np 
import csv
import json

# Pumpkins

In [2]:
pumpkins = pd.read_csv("../bee_data/1pumpkins.csv")

In [3]:
# removing two columns (Texas & Wisconsin) that have (D) in the value column instead of a number
pumpkins.drop(pumpkins.loc[pumpkins['Value']==' (D)'].index, inplace=True)

In [4]:
pumpkins['Value'] = pumpkins['Value'].astype(float)

In [5]:
pumpkins = pumpkins[["Year", "State", "Value", "Commodity"]]

In [6]:
total_pumpkins = pumpkins.rename(columns={'Year': 'year', 'State': 'state','Commodity': 'commodity', 'Value': 'pumpkins_cwt/ac'})

In [7]:
## basically cwt/ac is * 100
total_pumpkins['lbs'] = total_pumpkins['pumpkins_cwt/ac'] * 100

In [8]:
total_pumpkins = total_pumpkins[["year", "state", "lbs", "commodity"]]
total_pumpkins

     year         state      lbs commodity
0    2019      US TOTAL  21980.0  PUMPKINS
1    2019    CALIFORNIA  25500.0  PUMPKINS
2    2019      ILLINOIS  38500.0  PUMPKINS
3    2019       INDIANA  24500.0  PUMPKINS
4    2019      MICHIGAN  15000.0  PUMPKINS
..    ...           ...      ...       ...
174  2000      ILLINOIS  41000.0  PUMPKINS
175  2000      MICHIGAN  16000.0  PUMPKINS
176  2000      NEW YORK  20000.0  PUMPKINS
177  2000          OHIO  16500.0  PUMPKINS
178  2000  PENNSYLVANIA  17000.0  PUMPKINS

[177 rows x 4 columns]

# Almonds

In [9]:
almonds = pd.read_csv("../bee_data/2almonds.csv")

In [10]:
almonds.drop(almonds.loc[almonds['Period']=='YEAR - MAY FORECAST'].index, inplace=True)

In [11]:
almonds = almonds[["Year", "State", "Value", "Commodity"]]

In [12]:
almond_totals = almonds.rename(columns={'Year': 'year', 'State': 'state', 'Commodity': 'commodity', 'Value': 'lbs'})

In [1]:
almond_totals["lbs"] = almond_totals["lbs"].str.replace(",","")

NameError: name 'almond_totals' is not defined

In [14]:
almond_totals['lbs'] = almond_totals['lbs'].astype(int)
almond_totals

    year       state   lbs commodity
0   2017    US TOTAL  2200   ALMONDS
1   2017  CALIFORNIA  2200   ALMONDS
3   2016    US TOTAL  2210   ALMONDS
4   2016  CALIFORNIA  2210   ALMONDS
5   2015    US TOTAL  2000   ALMONDS
6   2015  CALIFORNIA  2000   ALMONDS
7   2014    US TOTAL  2010   ALMONDS
8   2014  CALIFORNIA  2010   ALMONDS
9   2013    US TOTAL  2280   ALMONDS
10  2013  CALIFORNIA  2280   ALMONDS
11  2012    US TOTAL  2310   ALMONDS
12  2012  CALIFORNIA  2310   ALMONDS
13  2011    US TOTAL  2540   ALMONDS
14  2011  CALIFORNIA  2540   ALMONDS
15  2010    US TOTAL  2220   ALMONDS
16  2010  CALIFORNIA  2130   ALMONDS
17  2009    US TOTAL  1960   ALMONDS
18  2009  CALIFORNIA  1880   ALMONDS
19  2008    US TOTAL  2400   ALMONDS
20  2008  CALIFORNIA  2300   ALMONDS
21  2007    US TOTAL  2170   ALMONDS
22  2007  CALIFORNIA  2170   ALMONDS

# Apples

In [15]:
apples = pd.read_csv("../bee_data/3apples.csv")

In [16]:
apples = apples[["Year", "State", "Value", "Commodity"]]

In [17]:
apple_totals = apples.rename(columns={'Year': 'year', 'State': 'state', 'Commodity': 'commodity', 'Value': 'lbs'})

In [18]:
apple_totals["lbs"] = apple_totals["lbs"].str.replace(",","")

In [19]:
apple_totals.drop(apple_totals.loc[apple_totals['lbs']==' (X)'].index, inplace=True)
apple_totals.drop(apple_totals.loc[apple_totals['lbs']==' (NA)'].index, inplace=True)
apple_totals.drop(apple_totals.loc[apple_totals['lbs']==' (D)'].index, inplace=True)

In [20]:
apple_totals['lbs'] = apple_totals['lbs'].astype(int)
apple_totals

     year          state    lbs commodity
0    2019       US TOTAL  37500    APPLES
1    2019     CALIFORNIA  24000    APPLES
2    2019       MICHIGAN  30500    APPLES
3    2019       NEW YORK  30000    APPLES
4    2019         OREGON  30000    APPLES
..    ...            ...    ...       ...
344  2007        VERMONT  13600    APPLES
345  2007       VIRGINIA  17900    APPLES
346  2007     WASHINGTON  34000    APPLES
347  2007  WEST VIRGINIA  16000    APPLES
348  2007      WISCONSIN  10800    APPLES

[333 rows x 4 columns]

# Blueberries

In [21]:
blueberries = pd.read_csv("../bee_data/4blueberries.csv")

In [22]:
blueberries.drop(blueberries.loc[blueberries['Value']==' (NA)'].index, inplace=True)

In [23]:
blueberries["Value"] = blueberries["Value"].str.replace(",","")

In [24]:
blueberries['Value'] = blueberries['Value'].astype(int)

In [25]:
total_blueberries = blueberries[["Year", "State", "Value", "Commodity"]]

In [26]:
blueberry_totals = total_blueberries.rename(columns={'Year': 'year', 'State': 'state', 'Commodity': 'commodity', 'Value': 'lbs'})
blueberry_totals

   year     state   lbs    commodity
0  2019  US TOTAL  2790  BLUEBERRIES
1  2019     MAINE  2790  BLUEBERRIES
2  2018  US TOTAL  2680  BLUEBERRIES
3  2018     MAINE  2680  BLUEBERRIES
4  2015  US TOTAL  4510  BLUEBERRIES
5  2015     MAINE  4510  BLUEBERRIES
6  2014  US TOTAL  4580  BLUEBERRIES
7  2014     MAINE  4580  BLUEBERRIES

# Cherries

In [27]:
cherries = pd.read_csv("../bee_data/5cherries.csv")

In [28]:
cherries.drop(cherries.loc[cherries['Value']==' (X)'].index, inplace=True)
cherries.drop(cherries.loc[cherries['Value']==' (NA)'].index, inplace=True)
cherries.drop(cherries.loc[cherries['Value']==' (D)'].index, inplace=True)

In [29]:
cherries["Value"] = cherries["Value"].str.replace(",","")

In [30]:
cherries['Value'] = cherries['Value'].astype(int)

In [31]:
total_cherries = cherries[["Year", "State", "Value", "Commodity"]]

In [32]:
cherry_total = total_cherries.rename(columns={'Year': 'year', 'State': 'state', 'Commodity': 'commodity', 'Value': 'lbs'})
cherry_total.head()

   year       state    lbs commodity
0  2019    US TOTAL   7680  CHERRIES
1  2019    MICHIGAN   6650  CHERRIES
2  2019    NEW YORK   2700  CHERRIES
3  2019        UTAH  18000  CHERRIES
4  2019  WASHINGTON  10700  CHERRIES

In [33]:
## total_pumpkins, almond_totals, apple_totals, blueberry_totals, cherry_total
first = pd.concat([total_pumpkins, almond_totals], join="inner")
first

    year       state      lbs commodity
0   2019    US TOTAL  21980.0  PUMPKINS
1   2019  CALIFORNIA  25500.0  PUMPKINS
2   2019    ILLINOIS  38500.0  PUMPKINS
3   2019     INDIANA  24500.0  PUMPKINS
4   2019    MICHIGAN  15000.0  PUMPKINS
..   ...         ...      ...       ...
18  2009  CALIFORNIA   1880.0   ALMONDS
19  2008    US TOTAL   2400.0   ALMONDS
20  2008  CALIFORNIA   2300.0   ALMONDS
21  2007    US TOTAL   2170.0   ALMONDS
22  2007  CALIFORNIA   2170.0   ALMONDS

[199 rows x 4 columns]

In [34]:
## total_pumpkins, almond_totals, apple_totals, blueberry_totals, cherry_total
second = pd.concat([first, apple_totals], join="inner")
second

     year          state      lbs commodity
0    2019       US TOTAL  21980.0  PUMPKINS
1    2019     CALIFORNIA  25500.0  PUMPKINS
2    2019       ILLINOIS  38500.0  PUMPKINS
3    2019        INDIANA  24500.0  PUMPKINS
4    2019       MICHIGAN  15000.0  PUMPKINS
..    ...            ...      ...       ...
344  2007        VERMONT  13600.0    APPLES
345  2007       VIRGINIA  17900.0    APPLES
346  2007     WASHINGTON  34000.0    APPLES
347  2007  WEST VIRGINIA  16000.0    APPLES
348  2007      WISCONSIN  10800.0    APPLES

[532 rows x 4 columns]

In [35]:
## total_pumpkins, almond_totals, apple_totals, blueberry_totals, cherry_total
third = pd.concat([second, blueberry_totals], join="inner")
third

    year       state      lbs    commodity
0   2019    US TOTAL  21980.0     PUMPKINS
1   2019  CALIFORNIA  25500.0     PUMPKINS
2   2019    ILLINOIS  38500.0     PUMPKINS
3   2019     INDIANA  24500.0     PUMPKINS
4   2019    MICHIGAN  15000.0     PUMPKINS
..   ...         ...      ...          ...
3   2018       MAINE   2680.0  BLUEBERRIES
4   2015    US TOTAL   4510.0  BLUEBERRIES
5   2015       MAINE   4510.0  BLUEBERRIES
6   2014    US TOTAL   4580.0  BLUEBERRIES
7   2014       MAINE   4580.0  BLUEBERRIES

[540 rows x 4 columns]

In [36]:
## total_pumpkins, almond_totals, apple_totals, blueberry_totals, cherry_total
all_crops = pd.concat([third, cherry_total], join="inner")
all_crops

     year         state      lbs commodity
0    2019      US TOTAL  21980.0  PUMPKINS
1    2019    CALIFORNIA  25500.0  PUMPKINS
2    2019      ILLINOIS  38500.0  PUMPKINS
3    2019       INDIANA  24500.0  PUMPKINS
4    2019      MICHIGAN  15000.0  PUMPKINS
..    ...           ...      ...       ...
100  2007        OREGON    769.0  CHERRIES
102  2007  PENNSYLVANIA   5830.0  CHERRIES
103  2007          UTAH   7140.0  CHERRIES
104  2007    WASHINGTON   8850.0  CHERRIES
105  2007     WISCONSIN   6120.0  CHERRIES

[635 rows x 4 columns]

In [37]:
all_crops['commodity'].unique()

array(['PUMPKINS', 'ALMONDS', 'APPLES', 'BLUEBERRIES', 'CHERRIES'],
      dtype=object)

In [38]:
all_crops["year"].unique()

array([2019, 2018, 2017, 2016, 2015, 2014, 2013, 2012, 2011, 2010, 2009,
       2008, 2007, 2006, 2005, 2004, 2003, 2002, 2001, 2000], dtype=int64)

In [39]:
all_crops.dtypes

year           int64
state         object
lbs          float64
commodity     object
dtype: object